[CelatidGrub X2CharacterTemplate]
strCharacterName="Celatid Grub"

[CelatidPupa X2CharacterTemplate]
strCharacterName="Celatid Pupa"

[CelatidAdult X2CharacterTemplate]
strCharacterName="Celatid Adult"

[CelatidTurret X2CharacterTemplate]
strCharacterName="Celatid Turret"

[CelatidTurretMk2 X2CharacterTemplate]
strCharacterName="Celatid Turret MK2"

[CelatidTurretMk3 X2CharacterTemplate]
strCharacterName="Celatid Turret MK3"

[CorpseCelatid X2ItemTemplate]
FriendlyName="Celatid Corpse"
FriendlyNamePlural="Celatid Corpses"
BriefSummary="A relatively new sight on the battlefield, the Celatid was not among the species seen in the Invader's initial combat forces. At first glance it looks to be some sort of gasbag and seems to have a similar combat role to the 'floater' subspecies.   The Celatid is a fusion of organic and mechanical parts. Reports suggest its capable of regeneration and it apparently makes use of biological excretions as a form of weaponry. We believe a full study of this creature could lead to some useful weapons technology."
 
[AutopsyCelatid X2TechTemplate]
DisplayName="Celatid Autopsy"
Summary="The Celatid is a floating gas bag that has an astonishing cellular regeneration growth."
CodeName="Gas Bag"
LongDescription="The Celatid is a simple organism, similar to early earth lifeforms like Echinoderms. The poison and acid it projects across the battlefield are actually it own organs, re-purposed for use as weaponry. One would think this is a disadvantage but the Celatids have a, frankly, unnatural regenerative ability and have been witnessed to survive a shocking amount of trauma. The creature's body is full of redundant organs and as near as we can tell they undergo several life stages gaining more and more internal complexity. Among other things we've detected asymmetrically distributed 'Psionic Nodules.' Seeing as how the Celatid lacks any identifiable form of natural sensory organ we believe that the creature uses these to detect hostile lifeforms. Finally we have the antigrav system that the Celatid uses as its primary form of locomotion. Originally it was assumed to simply be an augmentation to make the creature more viable in combat but we've discovered communications systems similar to those fielded in Advent MECs. Combining this information with how primitive Celatid biology is we hypothesize that these creatures are nothing more than drones with a significant biological component. R. Tygan."
 
[HybridAlienTurret X2TechTemplate]
DisplayName="Hybrid Alien Turret Tech"
Summary="Now that we understand how, and why Celatids function in the field we can work on producing our own versions of the Bio-Drone technology to field bio-drones of our own."
CodeName="FireFly"
LongDescription="We appear to have underestimated the computational capacity of the Celatid brain nodules. While it is doubtful that the creatures are truly sapient a preserved brain nodule can outpace any earth made computer from the early twenty first century. Due to the risks inherent in using psionic technology around the Advent network we've decided to re-purpose the Celatid brain nodules entirely and have actively retarded their latent psionic potential. This requires us to mount sensory equipment on their turret frame but it does save on the significant electronics costs that are entailed when producing an autonomous attack drone. As well as re-purposing the creature's biology we've decided to use salvage from the recovered Celatid cadavers to give the unit an anti-grav drive system of its own. So far all Celatid turrets come standard with a conventional armament. R. Tygan."

[HybridAlienSword X2TechTemplate]
DisplayName="Hybrid Alien Sword Tech"
Summary="With the information gained from a thorough examination of the Celatid's biology we believe we can give our soldiers a serious edge in combat. This will require some extensive experimentation. However, the miniaturization of life support equipment to transfer Celatid biology to the hybrid sword tech will be a rather novel set of hurdles to jump."
CodeName="Scimitar"
LongDescription="We have succeeded in producing a hilt that contains a single Celatid toxin gland. The biological matter is kept alive by a small automated system and produces a constant supply of deadly poison. This will allow us to produce blades using our current technology that should allow our soldiers to deliver a devastating melee strike that will have a serious lasting effect. R. Tygan."

[Ability_CelatidAlien_PoisonSpitM1 X2AbilityTemplate]
LocFriendlyName="Celatid Acid Spit"
LocLongDescription="Spit a glob of acid at a target."
LocHelpText="Spit a glob of acid at a target."
LocFlyOverText="Celatid Acid Spit"

[Ability_CelatidAlien_PoisonSpitM2 X2AbilityTemplate]
LocFriendlyName="Celatid Acid Spit"
LocLongDescription="Spit a glob of acid at a target."
LocHelpText="Spit a glob of acid at a target."
LocFlyOverText="Celatid Acid Spit"

[Ability_CelatidAlien_PoisonSpitM3 X2AbilityTemplate]
LocFriendlyName="Celatid Acid Spit"
LocLongDescription="Spit a glob of acid at a target."
LocHelpText="Spit a glob of acid at a target."
LocFlyOverText="Celatid Acid Spit"

[Ability_CelatidAlien_PoisonCloud X2AbilityTemplate]
LocFriendlyName="Poison Cloud"
LocLongDescription="Dispenses a poison cloud.If hit, this cloud can disorient or stun."
LocHelpText="Dispenses a poison cloud.If hit, this cloud can disorient or stun."
LocFlyOverText="Celatid Poison Cloud"

[Celatidportal X2AbilityTemplate]
LocFriendlyName="Celatid Portal"
LocLongDescription="Opens a Celatid Portal from which more Celatids and or Faceless Aliens might be called in as reinforcements."
LocHelpText="Open Celatid Portal."
LocFlyOverText="Open Celatid Portal"

[Scimitar_CV X2WeaponTemplate]
FriendlyName="Scimitar"
FriendlyNamePlural="Scimitars"
BriefSummary="This blade is designed to inflict poison effects. It does slightly more damage than the base sword"
TacticalText="This blade is designed to inflict poison effects. It does slightly more damage than the base sword"
AbilityDescName="Scimitar"

[Scimitar_MG X2WeaponTemplate]
FriendlyName="Magnetic Scimitar"
FriendlyNamePlural="Magnetic Scimitars"
BriefSummary="This advanced version ups its effectiveness with the ability to stun as well as and poison effects. It does slightly more damage than the base Mag sword"
TacticalText="This advanced version ups its effectiveness with the ability to stun as well as and poison effects. It does slightly more damage than the base Mag sword"
AbilityDescName="Magnetic Scimitar"

[Scimitar_BM X2WeaponTemplate]
FriendlyName="Plasma Scimitar"
FriendlyNamePlural="Plasma Scimitars"
BriefSummary="This advanced version ups its effectiveness with the ability to stun and poison effects. It does slightly more damage than the base Beam sword"
TacticalText="This advanced version ups its effectiveness with the ability to stun and poison effects. It does slightly more damage than the base Beam sword"
AbilityDescName="Plasma Scimitar"

[DeployableCelatidTurret X2AbilityTemplate]
LocFriendlyName="Deployable Celatid Turret"
LocLongDescription="Deploys a XCOM Celatid Turret at the specified location."
LocHelpText="Deploys a XCOM Celatid Turret at the specified location."
LocFlyOverText="Deploy Celatid Turret"

[DeployableCelatidTurretMk2 X2AbilityTemplate]
LocFriendlyName="Deployable Celatid Turret MK2"
LocLongDescription="Deploys a XCOM Celatid Turret MK2 at the specified location."
LocHelpText="Deploys a XCOM Celatid Turret MK2 at the specified location."
LocFlyOverText="Deploy Celatid Turret MK2"

[DeployableCelatidTurretMk3 X2AbilityTemplate]
LocFriendlyName="Deployable Celatid Turret MK3"
LocLongDescription="Deploys a XCOM Celatid Turret MK3 at the specified location."
LocHelpText="Deploys a XCOM Celatid Turret MK3 at the specified location."
LocFlyOverText="Deploy Celatid Turret MK3"

[DeployableCelatidTurret X2WeaponTemplate]
FriendlyName="Deployable Celatid Turret"
BriefSummary="The Celatid Turret provides additional fire support for our soldiers. It is deployed like a grenade, thrown to the spot where the turret will appear."
TacticalText="<Bullet/> Deploys a XCOM Celatid Turret at the specified location.\n<Bullet/> Does not expire until destroyed."

[DeployableCelatidTurretMk2 X2WeaponTemplate]
FriendlyName="Deployable Celatid Turret MK2"
BriefSummary="The Celatid Turret MK2 provides additional fire support for our soldiers. It is deployed like a grenade, thrown to the spot where the turret will appear."
TacticalText="<Bullet/> Deploys a XCOM Celatid Turret at the specified location.\n<Bullet/> Does not expire until destroyed."

[DeployableCelatidTurretMk3 X2WeaponTemplate]
FriendlyName="Deployable Celatid Turret MK3"
BriefSummary="The Celatid Turret MK3 provides additional fire support for our soldiers. It is deployed like a grenade, thrown to the spot where the turret will appear."
TacticalText="<Bullet/> Deploys a XCOM Celatid Turret at the specified location.\n<Bullet/> Does not expire until destroyed."

[CelatidImmunities X2AbilityTemplate]
LocFriendlyName="Celatid Immunities"
LocLongDescription="Immune to Poison Gas, Chryssalid Poison and Stun. However, can still be disoriented, panicked, mind controled, Dominated and or hurt by Acid."
LocHelpText="Immune to Poison Gas, Chryssalid Poison and Stun. However, can still be disoriented, panicked, mind controled, Dominated and or hurt by Acid"
LocFlyOverText="Immune"

[CelatidTurret_WPN X2WeaponTemplate]
FriendlyName="Celatid Turret"

[CelatidTurretMk2_WPN X2WeaponTemplate]
FriendlyName="Celatid Mag Turret"

[CelatidTurretMk3_WPN X2WeaponTemplate]
FriendlyName="Celatid Plasma Turret"



[CelSabotageAlienFacility X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Plant X4 to Destroy Celatid Cloning Facility"
ObjectiveTextPools[1]="Extract all XCOM soldiers"
ObjectiveTextPools[2]="Call in the skyranger and extract all soldiers to complete this mission."
ObjectiveTextPools[3]="Blade test 2"
ObjectiveTextPools[4]="Blade test 3"


[CelSabotageAlienFacility X2MissionTemplate]
DisplayName="Sabotage the Celatid Cloning Facility"
Briefing="Sabotage Celatid Cloning Facility"
PostMissionType="Sabotage Celatid Cloning Facility"
BriefingImage="img:///UILibrary_StrategyImages.X2StrategyMap.Alert_Advent_Facility"
ObjectiveTextPools[0]="Place X4 charges in Celatid Cloning facility"
ObjectiveTextPools[1]="Escape the Area of Operations"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_05"


